In [41]:
# groupby : 데이터를 특정 조건에 따라 그룹으로 분류하는 함수
import pandas as pd
import numpy as np

df = pd.DataFrame({'key1' : list('aabba'), 'key2' : ['one', 'two', 'one', 'two', 'one'], 'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one  1.439706  1.083535
1    a  two -0.565742 -2.498716
2    b  one -0.130489  0.062439
3    b  two  1.009344 -2.780127
4    a  one  0.326523 -0.595207

In [42]:
grouped = df['data1'].groupby(by=df['key1']) # data1 열을 key1 열의 기준으로 그룹화
grouped

In [43]:
grouped.groups

{'a': [0, 1, 4], 'b': [2, 3]}

In [44]:
grouped.sum()

key1
a    1.200488
b    0.878855
Name: data1, dtype: float64

In [45]:
df['data1'].groupby([df['key1'], df['key2']]).sum()

key1  key2
a     one     1.766230
      two    -0.565742
b     one    -0.130489
      two     1.009344
Name: data1, dtype: float64

In [46]:
df['data1'].groupby([df['key2'], df['key1']]).sum()

key2  key1
one   a       1.766230
      b      -0.130489
two   a      -0.565742
      b       1.009344
Name: data1, dtype: float64

In [47]:
df.groupby(df['key1']).sum()

           key2     data1     data2
key1
a     onetwoone  1.200488 -2.010388
b        onetwo  0.878855 -2.717689

In [48]:
df.groupby(by=['key1', 'key2']).sum()

              data1     data2
key1 key2
a    one   1.766230  0.488328
     two  -0.565742 -2.498716
b    one  -0.130489  0.062439
     two   1.009344 -2.780127

In [49]:
grouped.size() # a와 b의 개수(크기)를 알 수 있다.

key1
a    3
b    2
Name: data1, dtype: int64

In [50]:
for name, data in df.groupby('key1') :
    print(name)
    print(data)

a
  key1 key2     data1     data2
0    a  one  1.439706  1.083535
1    a  two -0.565742 -2.498716
4    a  one  0.326523 -0.595207
b
  key1 key2     data1     data2
2    b  one -0.130489  0.062439
3    b  two  1.009344 -2.780127

In [51]:
for name, data in df.groupby(['key1', 'key2']) :
    print(name)
    print(data)

('a', 'one')
  key1 key2     data1     data2
0    a  one  1.439706  1.083535
4    a  one  0.326523 -0.595207
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.565742 -2.498716
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.130489  0.062439
('b', 'two')
  key1 key2     data1     data2
3    b  two  1.009344 -2.780127

In [52]:
list(df.groupby('key1')) # 해당 부분을 리스트로 변경

[('a',
    key1 key2     data1     data2
  0    a  one  1.439706  1.083535
  1    a  two -0.565742 -2.498716
  4    a  one  0.326523 -0.595207),
 ('b',
    key1 key2     data1     data2
  2    b  one -0.130489  0.062439
  3    b  two  1.009344 -2.780127)]

In [53]:
d = dict(list(df.groupby('key1'))) # 위 값을 다시 딕셔너리에 넣어줄 때
d

{'a':   key1 key2     data1     data2
 0    a  one  1.439706  1.083535
 1    a  two -0.565742 -2.498716
 4    a  one  0.326523 -0.595207,
 'b':   key1 key2     data1     data2
 2    b  one -0.130489  0.062439
 3    b  two  1.009344 -2.780127}

In [54]:
d['a'] # 그렇게 되면, 특정값을 호출해주는 것 또한 가능해진다.

  key1 key2     data1     data2
0    a  one  1.439706  1.083535
1    a  two -0.565742 -2.498716
4    a  one  0.326523 -0.595207

In [55]:
df.dtypes # 각 해당부분에 대한 속성(타입) 출력 
# axis = 0 기준(축 = 0)

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [56]:
df.groupby(df.dtypes, axis=1).sum()

/var/folders/mr/zpw8mcz14pj_gkyqs4k_zl4c0000gn/T/ipykernel_1415/1312301622.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  df.groupby(df.dtypes, axis=1).sum()

    float64 object
0  2.523242   aone
1 -3.064458   atwo
2 -0.068051   bone
3 -1.770783   btwo
4 -0.268684   aone

In [57]:
df.groupby(df['key1'])['data1'].sum()

key1
a    1.200488
b    0.878855
Name: data1, dtype: float64

In [58]:
# 일부만 선택하여 함수를 적용하고 싶을 때
df.groupby(['key1', 'key2'])['data2'].sum()

key1  key2
a     one     0.488328
      two    -2.498716
b     one     0.062439
      two    -2.780127
Name: data2, dtype: float64

In [61]:
people = pd.DataFrame(np.random.randn(5,5),
                      columns = list('abcde'),
                      index = ['kim', 'choi', 'jeon', 'park', 'kang'])

people.iloc[2:3, [1,2]] = np.nan
people

             a         b         c         d         e
kim   1.323065  0.413431 -0.769559 -1.152534  1.562425
choi -0.246847  0.798937  0.846584 -1.243037  1.913178
jeon -0.771657       NaN       NaN -1.923061 -0.151804
park  1.117066  1.041366 -0.166028  1.168667  0.624239
kang  0.098108 -0.717182  1.235669  1.075159  0.693343

In [60]:
mapping = {'a' : 'red', 'b' : 'red', 'c' : 'blue', 'd' : 'red', 'e' : 'blue', 'f' : 'orange', 'g' : 'black'}
mapping

{'a': 'red',
 'b': 'red',
 'c': 'blue',
 'd': 'red',
 'e': 'blue',
 'f': 'orange',
 'g': 'black'}

In [64]:
people.groupby(mapping, axis=1).sum() # axis = 1 : 중심선이 한 개

/var/folders/mr/zpw8mcz14pj_gkyqs4k_zl4c0000gn/T/ipykernel_1415/2886351746.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(mapping, axis=1).sum() # axis = 1 : 중심선이 한 개

          blue       red
kim   0.792866  0.583961
choi  2.759761 -0.690948
jeon -0.151804 -2.694718
park  0.458211  3.327099
kang  1.929012  0.456086

In [70]:
people.T.groupby(mapping).sum()

           kim      choi      jeon      park      kang
blue  0.792866  2.759761 -0.151804  0.458211  1.929012
red   0.583961 -0.690948 -2.694718  3.327099  0.456086

In [74]:
ms = pd.Series(mapping)
ms

a       red
b       red
c      blue
d       red
e      blue
f    orange
g     black
dtype: object

In [75]:
people.T.groupby(ms).count() # 결측치 없이 출력된 값

      kim  choi  jeon  park  kang
blue    2     2     1     2     2
red     3     3     2     3     3

In [76]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.323065  0.413431 -0.769559 -1.152534  1.562425
4  0.196671  1.123121  1.916225 -0.922272  3.078955

In [79]:
k =  ['one', 'one', 'one', 'two', 'two']
people.groupby([len, k]).min() # 이름 길이를 기준으로 그룹화

              a         b         c         d         e
3 one  1.323065  0.413431 -0.769559 -1.152534  1.562425
4 one -0.771657  0.798937  0.846584 -1.923061 -0.151804
  two  0.098108 -0.717182 -0.166028  1.075159  0.624239

In [81]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'KR', 'KR'], [1, 3, 4, 1, 3]], names = ['city', 'pop'])
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 4),
            ('KR', 1),
            ('KR', 3)],
           names=['city', 'pop'])

In [82]:
c_df = pd.DataFrame(np.random.randn(4, 5), columns = columns)
c_df

city        US                            KR
pop          1         3         4         1         3
0    -0.048437  0.613828  0.667567  1.956351  0.534687
1    -0.335082 -0.510416  1.097037 -0.616835 -0.238829
2     0.201543  0.681390 -0.062610 -2.647235  1.564639
3     0.082169 -0.988872  0.225480 -1.359851  0.536717

In [84]:
c_df.groupby(level='city', axis=1).count() # city 기준, 중앙선 1개

/var/folders/mr/zpw8mcz14pj_gkyqs4k_zl4c0000gn/T/ipykernel_1415/1811875136.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  c_df.groupby(level='city', axis=1).count() # city 기준, 중앙선 1개

city  KR  US
0      2   3
1      2   3
2      2   3
3      2   3

In [87]:
c_df.groupby(level='pop', axis=1).count() # pop 기준, 중앙선 1개

/var/folders/mr/zpw8mcz14pj_gkyqs4k_zl4c0000gn/T/ipykernel_1415/3707763392.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  c_df.groupby(level='pop', axis=1).count() # pop 기준, 중앙선 1개

pop  1  3  4
0    2  2  1
1    2  2  1
2    2  2  1
3    2  2  1

conut, sum, mean, median, std, var, min, max

prod - NA 제외하고 곱

first, last - NA값을 제외하고 첫 번째, 마지막

In [88]:
df

  key1 key2     data1     data2
0    a  one  1.439706  1.083535
1    a  two -0.565742 -2.498716
2    b  one -0.130489  0.062439
3    b  two  1.009344 -2.780127
4    a  one  0.326523 -0.595207

In [92]:
group = df.groupby('key1')
group.quantitle(0.9) # groupby 함수가 아닌 pandas 함수
# quantile 분위수

AttributeError: 'DataFrameGroupBy' object has no attribute 'quantitle'

In [91]:
group.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.400163  1.004750 -0.565742 -0.119609  0.326523  0.883115
b      2.0  0.439427  0.805984 -0.130489  0.154469  0.439427  0.724386

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.439706   3.0 -0.670129  1.792301 -2.498716 -1.546962 -0.595207
b     1.009344   2.0 -1.358844  2.009998 -2.780127 -2.069486 -1.358844


           75%       max
key1
a     0.244164  1.083535
b    -0.648203  0.062439

In [93]:
def func_max_min(arr) :
    return arr.max() - arr.min()

In [95]:
group.agg(func_max_min)
group.aggregate(func_max_min) # 위 아래 코드가 같은 값을 나타낸다.

TypeError: unsupported operand type(s) for -: 'str' and 'str'